glodnickim/BAFANG_GD32F303RCT6/inc/main.h
/*!
    \file    main.h
    \brief   the header file of main 

   \version 2024-12-20, V3.0.1, firmware for GD32F30x
*/

/*
    Copyright (c) 2024, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this 
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, 
       this list of conditions and the following disclaimer in the documentation 
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors 
       may be used to endorse or promote products derived from this software without 
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT 
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR 
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
OF SUCH DAMAGE.
*/

#ifndef MAIN_H
#define MAIN_H


#include "gd32f30x.h"
#include <arm_math.h>
#include "systick.h"
#include "gd32f307c_eval.h"
#include "config.h"
#include <stdio.h>
#include <stdlib.h>
#include <stdbool.h>

/*
 * Power-stage lifecycle. `ui_8_PWM_ON_Flag` mirrors TIMER0 MOE/POEN: it is
 * set after MOE is enabled and cleared whenever a production path disables
 * MOE. It is not a torque-demand or FOC-write permission flag; ARMED_ZERO
 * keeps both MOE and the FOC ISR alive.
 *
 * PREPARE is the NEUTRAL_COMMIT -> FOC_RELEASE sequence. ARMED_ZERO is the
 * persistent normal no-torque state between ACTIVE runs. FAULT is terminal.
 */
#define BRIDGE_LIFECYCLE_DISABLED        0U
#define BRIDGE_LIFECYCLE_IDLE            BRIDGE_LIFECYCLE_DISABLED /* legacy name */
#define BRIDGE_LIFECYCLE_NEUTRAL_COMMIT  1U
#define BRIDGE_LIFECYCLE_MOE_ON          2U
#define BRIDGE_LIFECYCLE_NEUTRAL_DWELL   3U
#define BRIDGE_LIFECYCLE_FOC_RELEASE     4U
#define BRIDGE_LIFECYCLE_RUN             5U /* ACTIVE */
#define BRIDGE_LIFECYCLE_ARMED_ZERO      6U
#define BRIDGE_LIFECYCLE_FAULT           7U

extern uint8_t ui_8_PWM_ON_Flag;
extern uint8_t bridge_lifecycle;


/* led spark function */
void led_spark(void);
void TIMER2_IRQHandler(void);
void runPIcontrol(void);
void write_virtual_eeprom(void);
void read_virtual_eeprom(void);
/*
 * FW-110 v4: autodetect() drives the motor open-loop for >5 s. It is UNREACHABLE from any
 * CAN command: the FW-110 v3 supervisor that used to mediate 0x6200 requests is removed, and
 * 0x6200 itself answers with a single ERROR_ACK in both firmware variants (see
 * src/CAN_Display.c). autodetect()'s body is deliberately untouched by this card.
 *
 * HONEST LIMITATION (not mitigated by this card): once this function starts, IT is the main
 * loop for the whole of its own >5 s run - nothing else in main()'s while(1) executes until it
 * returns, including the PAS/speed decode this same standstill check depends on. The guard at
 * the top of this function's own body is therefore a POINT-IN-TIME check, true at the instant
 * the motor starts turning, not a continuous one held throughout the run. Physical safety during
 * those >5 s (the rider not touching the pedals/throttle) is not verified in software here - it
 * would require rewriting this procedure itself into a non-blocking automaton, which is real
 * motor-control work outside this card's CAN-queueing scope, not something a comment can supply.
 */
void autodetect(void);
extern uint16_t slow_loop_counter;
/* FW-127A: the REQUESTED SVPWM geometry, signed. svpwm()'s arithmetic can legitimately go
 * negative and can exceed ARR (see inc/pwm_geometry.h for the proof); storing it unsigned made
 * both cases invisible. The APPLIED geometry - the only thing the timer and every sampling
 * decision may use - is pwm_applied[] below. */
extern int32_t switchtime[3];
/* FW-127A: the APPLIED geometry. This is what was actually written to TIMER0 CH0/CH1/CH2, and
 * therefore the only geometry any sampling/reconstruction decision is allowed to describe. */
extern uint16_t pwm_applied[3];
extern uint32_t timeout;
extern uint8_t transmit_mailbox;
extern can_trasnmit_message_struct transmit_message;
extern can_receive_message_struct receive_message;
extern FlagStatus receive_flag;
extern int32_t Z_position;
extern int32_t PWM_offset;

enum state {Stop, SixStep, Regen, Running, BatteryCurrentLimit, Interpolation, PLL, IdleRun, Sensorless, OpenLoop};
enum com_mode {Hallsensor, Sensorless_openloop, Sensorless_startkick, Hallsensor_Sensorless};
enum operation {WRITE_CMD,READ_CMD,NORMAL_ACK,ERROR_ACK, LONG_START_CMD, LONG_TRANG_CMD ,LONG_END_CMD,LONG_WARNING_CMD};

typedef struct
{

	int32_t       	Voltage;
	uint32_t       	Speedx100;
	int32_t         i_d;
	int32_t         i_q;
	int32_t 		i_q_setpoint;
	int32_t 		i_d_setpoint;
	int32_t 		i_setpoint_abs;
	/* FW-094: i_q_setpoint_temp / i_d_setpoint_temp removed. They were the removed assist
	 * monolith's scratch registers; the ride core returns its request by value. MotorState_t is
	 * runtime only (never persisted), so dropping them changes no stored layout. */
	int32_t         u_d;
	int32_t         u_q;
	int32_t         u_abs;
	int32_t         Battery_Current;
	int32_t			teta_obs;
	float       	distance_since_startup;
	int32_t       	sin_delay_filter;
	int32_t       	cos_delay_filter;
	int16_t 		torque_on_crank;
	uint16_t 		torque_filtered;
	uint16_t 		p_human;
	uint16_t        calories;
	uint16_t        range;
	int16_t         int_Temperature;
	int16_t 		KV_detect_flag;
	uint8_t 		hall_angle_detect_flag;
	uint8_t 		assist_level;
	uint8_t 		SOC;
	int8_t         	system_state;
	int8_t         	level_counter_global;
	FlagStatus      offroadflag;
	uint8_t         offroadtics;
	uint8_t         bank_splash_kmh; //FW-005: brief speed-field override after bank switch (10/20 km/h), 0 = off
	int8_t         	error_state;
	int8_t 			angle_est;
	uint8_t 		cadence;
	int8_t 			Obs_flag;
	int8_t 			TQfilter;
	/* FW-094: ext_boost_duration / ext_boost_strength removed. They cached the per-level
	 * Para2 bytes for the removed overrun block. FW-084 Extended Boost is per-level config
	 * inside the profile bank (assist_extended_boost_config_t) and never used these. */
	FlagStatus 		pushassist_flag;
	FlagStatus 		walk_can_request;
	FlagStatus 		light_flag;
	FlagStatus 		button_up_flag;
	FlagStatus 		button_down_flag;
	FlagStatus 		brake_active_flag;

	//--- SOC / Range (runtime, not persisted in EEPROM) ---
	float       	remaining_mah;   // coulomb counter: charge left in pack [mAh]
	float       	used_wh;         // energy drawn this trip [Wh] (signed; regen subtracts)
	float       	avg_wh_per_km;   // EMA consumption used for range [Wh/km]
	float       	soc_real;        // SOC from coulomb counting [%]
	float       	soc_display;     // SOC shown to user (filtered) [%]
	int8_t        	soc_voltage;     // SOC from IR-compensated OCV lookup [%]

}MotorState_t;

/*
 * FW-094 — ORPHANED BUT FROZEN FIELDS.
 *
 * These are still parsed from and echoed back to the Bafang Para blocks, but after the removal
 * of the pre-ride-core assist path NOTHING in the firmware reads them to make a riding
 * decision. They are kept, in place and at their exact sizes, for two independent reasons:
 *
 *   1. sizeof(MotorParams_t) is part of the FW-023 stored-record length check. Change it by one
 *      byte and every record already written fails validation, so every setting on the bike
 *      silently reverts to defaults on the next boot.
 *   2. The shipped app reads and writes the Para bytes they map to. Dropping the round-trip
 *      would make those fields read back as garbage.
 *
 *   decay_base        Para1[21]  - was the cadence-assist decay curve
 *   Cadence_exponent  Para1[12]  - was the cadence exponent of that curve
 *   Override_Duration Para1[37]  - was the overrun/"power drag-on" duration
 *   MagicNumber       Para1[24..25] - unread since FW-050 (offroad gesture is a fixed sequence)
 *   TS_coeff          0x62D9     - was the cadence-assist gain
 *   ramp_end          Para1[39]  - unread; no consumer has existed for several releases
 *   assist_profile    Para2[0..29]  - was the per-level speed/assist interpolation table
 *   ext_boost_*       Para2[31..41] - was the per-level overrun duration/strength
 *   TQO_threshold     Para0      - now only a parser sanity/repair value, not an assist input
 *
 * Removing them is a protocol change, not a cleanup: it needs a Para-block version bump and a
 * matching app release. See section C of the FW-094 audit.
 */
typedef struct
{

	uint16_t       	wheel_cirumference;
	uint16_t       	decay_base;        //orphan, see the note above
	uint16_t       	Cadence_exponent;  //orphan
	uint16_t       	Override_Duration; //orphan
	uint16_t       	MagicNumber;       //orphan
	uint16_t       	TS_coeff;          //orphan
	uint16_t       	PAS_timeout;
	uint16_t       	ramp_end;          //orphan
	uint16_t       	throttle_offset;
	uint16_t       	throttle_max;
	uint16_t       	active_profile_bank; //was torque_offset (unused); FW-005: 0 = Power bank, 1 = eMTB bank
	uint16_t       	torque_full_scale_native; //was torque_max (unused); 0 = not calibrated
	uint16_t       	gear_ratio;
	uint16_t       	phase_current_max;
	uint16_t		battery_current_max;
	int16_t       	voltage_min;
	uint16_t       	speedLimitx100;
	uint16_t       	walk_assist_speed; // raw front-chainring RPM; legacy field name kept for EEPROM/CAN
	uint8_t        	walk_assist_current; // 0-100 %, maps to Para1[36] (speed_limit_enabled in JS)
	uint16_t       	TQO_threshold[6];   //orphan (parser sanity value only)
	uint8_t       	com_mode;
	int8_t       	system_voltage;
	int8_t       	max_voltage;
	int8_t       	reverse; //use field Motor Type (Para1[18]) 1 = 1, 0 = -1
	int8_t       	legalflag; //use field Coaster Brake Support

	uint8_t       	pulses_per_revolution;
	uint8_t 		assist_profile[5][6];  //orphan: five assist levels with 6 assist factors each
	uint8_t 		assist_settings[6][3]; //LIVE: 0 current limit, 1 speed limit, 2 ride mode (per level)
	uint8_t 		ext_boost_duration[6]; //orphan
	uint8_t 		ext_boost_strength[6]; //orphan
	q31_t 			angle_correction;

	//--- Battery SOC / Range params (appended at end to keep EEPROM offsets stable) ---
	uint16_t       	battery_capacity_mah;           // expected capacity, Canable Para1[7..8]
	uint16_t       	battery_capacity_estimated_mah; // learned capacity (slow adaptation)
	uint16_t       	r_batt_mohm;                    // pack internal resistance for IR comp [mOhm]
	uint8_t       	limp_soc_limit;                 // Canable Para1[10], 0xFF = disabled
	uint8_t       	limp_soc_limit_stage2;          // Canable Para1[11], 0xFF = disabled

	//--- FW-006: profile bank storage (appended at end to keep EEPROM offsets stable) ---
	// FW-068/069: 320 B per bank (wire format v6 uses 295) so the next per-level field costs a
	// version bump, not another change of MotorParams_t — every size change here invalidates the
	// whole stored record (FW-023 length check) and resets ALL settings to defaults.
	uint16_t       	bank_store_magic;               // 0xB16B = bank_store holds valid serialized banks
	uint8_t       	bank_store[2][256];             // serialized bank blobs (wire format v8, 255 B used — full)

	//--- FW-010: global ride-feel tuning storage (appended at end) ---
	uint16_t       	tuning_store_magic;             // 0x7501 = tuning_store holds valid values
	uint8_t       	tuning_store[64];               // serialized tuning blob (FW-068: wire format v6, 32 B used)

	//--- FW-013: user torque calibration (span only; zero is always automatic) ---
	uint16_t       	torque_cal_magic;               // 0x7C41 = fields below hold a valid user calibration
	uint8_t        	torque_cal_version;             // 1
	uint8_t        	torque_cal_pad;
	uint16_t       	torque_cal_span_native;         // native span for 60.00 kg
	uint16_t       	torque_cal_crc;                 // CRC16-CCITT over version+span

	//--- FW-076: persisted Bafang wheel-diameter code (0x3203 bytes 2-3) ---
	// Reuses the FW-014 ride-engine slot, which went dead when engine selection was removed
	// in FW-030: uint16 + uint8 + uint8 in, uint16 + uint8[2] out. Same size, same order,
	// same alignment — deliberately, because ANY change to sizeof(MotorParams_t) invalidates
	// the stored record (FW-023 length check) and resets every setting the rider has.
	uint16_t       	wheel_diameter_magic;           // 0x5744 = wheel_diameter_code is valid
	uint8_t        	wheel_diameter_code[2];         // raw Bafang code, e.g. B5 01 = 27.5"

	//--- FW-018: configurable full-charge PACK voltage (100% anchor at boot) ---
	uint16_t       	soc_full_magic;                 // 0x5F01 = soc_full_pack_10mv holds a valid threshold
	uint16_t       	soc_full_pack_10mv;             // full-charge pack voltage in units of 10 mV (4587 = 45.87 V); 0 = not set

}MotorParams_t;

typedef struct
{
	float       	gain_p;
	float       	gain_i;
	int16_t       	limit_i;
	int16_t       	limit_output;
	int16_t       	recent_value;
	int32_t       	setpoint;
	float       	integral_part;
	int16_t       	max_step;
	int32_t       	out;
	int8_t       	shift;

}PI_control_t;

#endif /* MAIN_H */
